snlkuharlocal/src/DataProcessors/ПечатьНакладных/ПечатьНакладных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПечатьНакладных</name>
  <attributes>
    <name>ДокОбъект</name>
    <type>
      <types>DocumentObject.РасходнаяНакладная</types>
      <types>DocumentObject.ЛистНабора</types>
      <types>DocumentObject.Претензия</types>
      <types>DocumentObject.ПриходнаяНакладная</types>
      <types>DocumentObject.Перемещение</types>
      <types>DocumentObject.КоррекцияРНК</types>
      <types>DocumentObject.Паллета</types>
      <types>DocumentObject.ЭмиссияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопПараметры</name>
  </attributes>
</mdclass:DataProcessor>

snlkuharlocal/src/Enums/ВидыШК/ВидыШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыШК</name>
  <enumValues>
    <name>Основной</name>
  </enumValues>
  <enumValues>
    <name>Дополнительный</name>
  </enumValues>
  <enumValues>
    <name>Временный</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Новый НДС</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>(Общ) Ставка НДС 22%</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/СчетФактура/СчетФактура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактура</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.Чек</basedOn>
  <basedOn>Document.ПродажаИМ</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС18</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаСовсемБезНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСпособаВыставления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Накладные</name>
    <attributes>
      <name>Накладная</name>
      <type>
        <types>DocumentRef.Чек</types>
        <types>DocumentRef.ПродажаИМ</types>
        <types>String</types>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС18</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС10</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСовсемБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЧека</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Авансы</name>
    <attributes>
      <name>ДатаПлатежноРасчетногоДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЗадолженности</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаЦенВНакладной</types>
        <types>DocumentRef.ПоступлениеНаРасчетныйСчет</types>
        <types>DocumentRef.ОплатаПлатежнойКартой</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КорректируемыйСчетФактура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПлатежноРасчетногоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСчетаФактурыПродавца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДСДоКорректировки</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДСДоКорректировки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетФактураНаАванс</name>
      <type>
        <types>DocumentRef.СчетФактураНаАванс</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Catalogs/ВидыДопОбработки/ВидыДопОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыДопОбработки</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезОбработки</name>
      <description>Без обработки</description>
    </items>
    <items>
      <name>ЕвроКрючок</name>
      <description>Евро-крючок</description>
    </items>
    <items>
      <name>ЗаказыFBS_КонтрольКодовМаркировки</name>
      <description>Заказы FBS. Контроль кодов маркировки</description>
    </items>
    <items>
      <name>Комплектация</name>
      <description>Комплектация</description>
    </items>
    <items>
      <name>ОтгрузкаУпаковкиОтдельно</name>
      <description>Отгрузка упаковки</description>
    </items>
    <items>
      <name>ПаллетаКроссДокинг</name>
      <description>Паллета КроссДокинг</description>
    </items>
    <items>
      <name>Паллетирование</name>
      <description>Паллетирование</description>
    </items>
    <items>
      <name>УпаковкаВКосметичку</name>
      <description>Упаковка в косметичку</description>
    </items>
    <items>
      <name>УпаковкаТовара</name>
      <description>Упаковка товара</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПаллетирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Неиспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьУпаковку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/ШтрихКоды/ШтрихКоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШтрихКоды</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидШК</name>
    <type>
      <types>EnumRef.ВидыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаМодификации</name>
    <type>
      <types>EnumRef.ПричиныКорректировкиШК</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтВКоробе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматШК</name>
    <type>
      <types>EnumRef.ФорматыШК</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКодGS1</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/DataProcessors/ПечатьНакладных/ObjectModule.bsl
Функция ПечатьПакетная(ДопПараметры=Неопределено) Экспорт 
	//крохин начало
	//Катаев+ 31/10/13 Добавил документ
	ЗаписатьВЛог("Печать Документов","Печать накладных. Документ: "+ДокОбъект+" Пользователь: "+ИмяПользователя()+", компьютер: "+ИмяКомпьютера(),"Информация");
	//крохин конец
	
	ТабДок	= Новый ТабличныйДокумент;
	
	МетаДок		= ДокОбъект.Метаданные();
	ВидДокумента= МетаДок.Имя;
	
	Если ВидДокумента="РасходнаяНакладная" Тогда
		ВидНакладной="Расходная накладная";
		Получатель	=ДокОбъект.Контрагент;
	ИначеЕсли ВидДокумента="ПриходнаяНакладная" Тогда
		ВидНакладной="Приходная накладная";				
		Получатель	=ДокОбъект.Склад;
	ИначеЕсли ВидДокумента="Перемещение" Тогда
		ВидНакладной="Перемещение";		
		Получатель	=ДокОбъект.СкладПолучатель;
	ИначеЕсли ВидДокумента="ОтчетКассовойСмены" Тогда
		ВидНакладной="ОКС";		
		Получатель	=ДокОбъект.Касса;				
	ИначеЕсли ВидДокумента="ПродажаИМ" Тогда
		ВидНакладной="Продажа интернет-магазина";		
		Получатель	=ДокОбъект.Контрагент;
	Иначе
		ВидНакладной="";		
	КонецЕсли; 
	
	Макет=ПолучитьМакет("Накладная");
	ОблЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	//крохин начало 23.08.2011
	//в ЛН нет организации	
	//ОблЗаголовок.Параметры.Фирма		= Объект.Организация.НаименованиеПолное;
	МетаданныеДокумента = ДокОбъект.Метаданные();
	Если ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда
		ОблЗаголовок.Параметры.Фирма		= ДокОбъект.Организация.НаименованиеПолное;
	Иначе
		ОблЗаголовок.Параметры.Фирма        = Справочники.Организации.НайтиПоКоду("SS-001").НаименованиеПолное; 
	КонецЕсли;
	//крохин конец 23.08.2011
	ОблЗаголовок.Параметры.Склад		= "Склад: "+ДокОбъект.Склад;
	ОблЗаголовок.Параметры.ВидНакладной = ВидНакладной;
	ОблЗаголовок.Параметры.Номер		= ДокОбъект.Номер;		
	ОблЗаголовок.Параметры.Дата			= Формат(ДокОбъект.Дата,"ДФ=dd.MM.yyyy");		
	ОблЗаголовок.Параметры.Получатель	= Получатель;
	Попытка
		ОблЗаголовок.Параметры.ДатаОтгрузки	= "Дата отгрузки: "+Формат(ДокОбъект.ДатаОтгрузки,"ДФ=dd.MM.yyyy");			
	Исключение
		
	КонецПопытки;
	
	Если ЕстьРеквизитДокумента("Комментарий",МетаДок) Тогда
		ОблЗаголовок.Параметры.Комментарий	= СокрЛП(ДокОбъект.Комментарий);	
	КонецЕсли; 
	
	ТабДок.Вывести(ОблЗаголовок);
	
	Если ВидДокумента="РасходнаяНакладная" И ДокОбъект.ДопОбработка>0 Тогда
		ТабДок.Вывести(Макет.ПолучитьОбласть("ЗаголовокДопОбработка"));
		Для Каждого СтрокаТЧ Из ДокОбъект.ДопОбработки Цикл
			Если СтрокаТЧ.ВидДопОбработки=Справочники.ВидыДопОбработки.БезОбработки Тогда Продолжить КонецЕсли; 
			
			ОблСтрока=Макет.ПолучитьОбласть("СтрокаДопОбработки");		
			ОблСтрока.Параметры.Заполнить(СтрокаТЧ);
			
			ОблСтрока.Параметры.ВидДопОбработки = ?(Пустаястрока(строкаТЧ.ВидДопОбработки.Описание) ,строкаТЧ.ВидДопОбработки,СтрокаТЧ.ВидДопОбработки.Описание);
			
			
			ТабДок.Вывести(ОблСтрока);			
		КонецЦикла;	
	КонецЕсли;
	
	ОблШапка	= Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.Вывести(ОблШапка);
	
	ТШК=ПолучитьШтрихКоды(ДокОбъект.Товары);
	
	Сч=0;
	
	//нечаева 03,07,14 добавила кцн++
	//16,07,14 +++ нечаева
	//ТекДокумент=Объект;
    ТК = ПолучитьТаблицуНакладной(ДокОбъект);               
	//16,07,14 --- нечаева
	//нечаева 03,07,14 добавила кцн--
	
	
	Для Каждого СтрокаТоваров Из ТК Цикл
		Если СтрокаТоваров.Количество=0 Тогда Продолжить КонецЕсли; 
		
		СтрокаТШК=ТШК.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
		Если СтрокаТШК=Неопределено Тогда
			СтрокаТШК=ТШК.Добавить();			
			СтрокаТШК.Номенклатура=СтрокаТоваров.Номенклатура;
		КонецЕсли; 
		
		Сч=Сч+1;
		
		ОблСтрока	= Макет.ПолучитьОбласть("Строка");
		
		ОблСтрока.Параметры.Сч=Сч;
		
		ОблСтрока.Параметры.Заполнить(СтрокаТоваров);					
		ОблСтрока.Параметры.Заполнить(СтрокаТоваров.Номенклатура);		
		ОблСтрока.Параметры.ШтрихКод=СтрокаТШК.ШтрихКод;
		
		ТабДок.Вывести(ОблСтрока);		
	КонецЦикла; 
	
	// нечаева ++
	Если ВидДокумента="ПродажаИМ" Тогда
		
		Для Каждого СтрокаТоваров Из ДокОбъект.Услуги Цикл
			//Если СтрокаТоваров.Количество=0 Тогда Продолжить КонецЕсли; 
			
			СтрокаТШК=ТШК.Найти(СтрокаТоваров.Номенклатура,"Номенклатура");
			Если СтрокаТШК=Неопределено Тогда
				СтрокаТШК=ТШК.Добавить();			
				СтрокаТШК.Номенклатура=СтрокаТоваров.Номенклатура;
			КонецЕсли; 
			
			Сч=Сч+1;
			
			ОблСтрока	= Макет.ПолучитьОбласть("Строка");
			
			ОблСтрока.Параметры.Сч=Сч;
			
			ОблСтрока.Параметры.Заполнить(СтрокаТоваров);					
			ОблСтрока.Параметры.Заполнить(СтрокаТоваров.Номенклатура);		
			ОблСтрока.Параметры.ШтрихКод=СтрокаТШК.ШтрихКод;
			ОблСтрока.Параметры.Количество=0;
			
			ТабДок.Вывести(ОблСтрока);		
		КонецЦикла; 
		
		ОблПодвал	= Макет.ПолучитьОбласть("ПодвалИМ");
		ОблПодвал.Параметры.Сч=Сч;
		ОблПодвал.Параметры.Количество	=ДокОбъект.Товары.Итог("Количество");
		
		ОблПодвал.Параметры.Всего		=ДокОбъект.Товары.Итог("Всего")+ДокОбъект.Услуги.Итог("Всего");
		
		//крохин начало 06.03.2012
		//есть ещё оплата сертификатом
		//ОблПодвал.Параметры.ВсегоКОплате=Объект.Товары.Итог("Всего")+Объект.Услуги.Итог("Всего")-Объект.СуммаБонуса;
		ОблПодвал.Параметры.СуммаОплатыСертификатом = ДокОбъект.СуммаОплатыСертификатом;
		ОблПодвал.Параметры.ВсегоКОплате=ДокОбъект.Товары.Итог("Всего")+ДокОбъект.Услуги.Итог("Всего")-ДокОбъект.СуммаБонуса-ДокОбъект.СуммаОплатыСертификатом;
		//крохин конец 06.03.2012
		ОблПодвал.Параметры.СуммаБонуса	=ДокОбъект.СуммаБонуса;
		
		
	Иначе
		
		
		ОблПодвал	= Макет.ПолучитьОбласть("Подвал");
		ОблПодвал.Параметры.Сч=Сч;
		ОблПодвал.Параметры.Количество	=ДокОбъект.Товары.Итог("Количество");
		
		//крохин начало 06.09.2011	
		//какая-то ахинея, все закомментировал
		//		//крохин начало 23.08.2011
		//	//в ЛН нет организации	
		//	//ОблПодвал.Параметры.Всего		=Объект.Товары.Итог("Всего");
		//	МетаданныеДокумента = Объект.Метаданные();
		//	Если ЕстьРеквизитДокумента("Организация",МетаданныеДокумента) Тогда
		//	ОблЗаголовок.Параметры.Фирма		= Объект.Организация.НаименованиеПолное;
		//Иначе
		//	ОблПодвал.Параметры.Всего		=0; 
		//	КонецЕсли;
		//	//крохин конец 23.08.2011
		ОблПодвал.Параметры.Всего		=ТК.Итог("Всего");
		//крохин конец 06.09.2011
		
	КонецЕсли;
	
	ТабДок.Вывести(ОблПодвал);		
	
	ЗаполнениеДокументов.ВывестиКонтрольнуюИнформациюВВыходнуюТаблицуСервер(ДокОбъект,ТабДок,ПолучитьМакет("Накладная"));
	
	ТабДок.ИмяПараметровПечати	= "ПараметрыПечати_"+ЭтотОбъект.Метаданные().Имя+"_"+ВидДокумента;
	ТабДок.ОтображатьСетку 		= Ложь;	
	ТабДок.ОтображатьЗаголовки 	= Ложь;
	
	Возврат ТабДок;
	
КонецФункции // ПечатьПакетная()


Функция ПолучитьШтрихКоды(ТЧ)
	Номенклатура=ТЧ.ВыгрузитьКолонку("Номенклатура");
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ШтрихКоды.Владелец КАК Номенклатура,
	|	ШтрихКоды.Наименование КАК ШтрихКод
	|ИЗ
	|	Справочник.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Владелец В(&Номенклатура)
	//крохин начало 22.09.2015
	//все 9 - служебный ШК, не для печати
    |	И ШтрихКоды.Наименование <> ""9999999999999""	
	//крохин конец 22.09.2015
	|	И ШтрихКоды.ТипШК = &ТипШК
	|	И ШтрихКоды.ВидШК = &ВидШК";
	
	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("ТипШК",Перечисления.ТипыШтрихКодов.Штука);
	Запрос.УстановитьПараметр("ВидШК",Перечисления.ВидыШК.Основной);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции // ПолучитьШтрихКоды()

//нечаева 03,07,14 добавила кцн++
Функция ПолучитьТаблицуНакладной(ТекДокумент, Режим="Накладная",СФ=Неопределено)
	ТН=Новый ТаблицаЗначений;
	
	ТН.Колонки.Добавить("Номенклатура");	
	ТН.Колонки.Добавить("Количество");
	ТН.Колонки.Добавить("НДС");
	ТН.Колонки.Добавить("Сумма");
	ТН.Колонки.Добавить("Всего");	
	
	Если Режим="СФ"  Тогда		
		Если СФ=Неопределено ИЛИ СФ.Пустая() Тогда
			СообщитьИзМодуля("Невоможно определить сводную СФ для печати !");		
		Иначе
			Запрос=Новый Запрос;
			Запрос.Текст="ВЫБРАТЬ Накладная ИЗ Документ.СчетФактура.Накладные ГДЕ Ссылка=&СФ";
			Запрос.УстановитьПараметр("СФ",СФ);			
			СписокНакладных=Запрос.Выполнить().Выгрузить();
			
			Запрос=Новый Запрос;
			Запрос.Текст="
			|ВЫБРАТЬ
			|	Номенклатура,
			|	СУММА(Количество) КАК Количество,
			|	СУММА(НДС) КАК НДС,
			|	СУММА(Всего) КАК Всего,
			|	Номенклатура.Родитель КАК Модель
			|ИЗ
			|	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
			|ГДЕ
			|	РасходнаяНакладнаяТовары.Ссылка.Ссылка В(&СписокНакладных)
			|СГРУППИРОВАТЬ ПО Номенклатура";		
			
			Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
			ИсходнаяТЧ=Запрос.Выполнить().Выгрузить();		
		КонецЕсли; 
	Иначе
		ИсходнаяТЧ=ТекДокумент.Товары.выгрузить();		
	КонецЕсли;
	
	
	//*кцн добавм
	НеУчитыватьРекламации=ложь;
	//крохин начало 15.09.2014
	//а ЛН нет колонок с ценами и рекламаций
	//Если НЕ НеУчитыватьРекламации Тогда
	Если ТипЗнч(СписокНакладных) = ТипЗнч(Документы.ЛистНабора.ПустаяСсылка()) Тогда
	ИначеЕсли НЕ НеУчитыватьРекламации Тогда
	//крохин конец 15.09.2014
	
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	СУММА(РекламационнаяНакладнаяТовары.Количество) КАК Количество,
		|	СУММА(РекламационнаяНакладнаяТовары.НДС) КАК НДС,
		|	СУММА(РекламационнаяНакладнаяТовары.Всего) КАК Всего
		|ИЗ
		|	Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
		|ГДЕ
		|	РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И РекламационнаяНакладнаяТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламационнаяНакладнаяТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ТекДокумент.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество = -СтрокаТЧ.Количество;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		// нечаева 20,11,13  +++
		
		// рекламации по ценам
		// нечаева 05,02,14 +++++++++++
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) КАК Количество,
		|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) КАК НДС,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Всего) КАК Всего
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
		|ГДЕ
		|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЦенВНакладнойТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ТекДокумент.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = -СтрокаТЧ.НДС;
			СтрокаТН.Всего = -СтрокаТЧ.Всего;
			СтрокаТН.Количество =0;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		// нечаева 05,02,14 -----------
		
	Иначе
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	КорректировкаЦенВНакладнойТовары.Номенклатура,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Количество) как количество,
		|	СУММА(КорректировкаЦенВНакладнойТовары.НДС) как ндс,
		|	СУММА(КорректировкаЦенВНакладнойТовары.Всего)  как всего
		|ИЗ
		|	Документ.КорректировкаЦенВНакладной.Товары КАК КорректировкаЦенВНакладнойТовары
		|ГДЕ
		|	КорректировкаЦенВНакладнойТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И (НЕ КорректировкаЦенВНакладнойТовары.Ссылка.Проведен)
		|	И КорректировкаЦенВНакладнойТовары.Ссылка.Отработано = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	КорректировкаЦенВНакладнойТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ТекДокумент.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = СтрокаТЧ.НДС;
			СтрокаТН.Всего = СтрокаТЧ.Всего;
			СтрокаТН.Количество = 0;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		
		
		// рекламации по ценам
		// нечаева 05,02,14 +++++++++++
		
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		|	РекламационнаяНакладнаяТовары.Номенклатура,
		|	СУММА(РекламационнаяНакладнаяТовары.Количество) как количество,
		|	СУММА(РекламационнаяНакладнаяТовары.НДС) как ндс,
		|	СУММА(РекламационнаяНакладнаяТовары.Всего)  как всего
		|ИЗ
		|	Документ.РекламационнаяНакладная.Товары КАК РекламационнаяНакладнаяТовары
		|ГДЕ
		|	РекламационнаяНакладнаяТовары.Ссылка.ДокОснование.Ссылка В(&СписокНакладных)
		|	И (НЕ РекламационнаяНакладнаяТовары.Ссылка.Проведен)
		|	И РекламационнаяНакладнаяТовары.Ссылка.Отработано = Истина
		|
		|СГРУППИРОВАТЬ ПО
		|	РекламационнаяНакладнаяТовары.Номенклатура";		
		Если  СписокНакладных = Неопределено Тогда
			СписокНакладных = ТекДокумент.Ссылка;
		КонецЕсли;
		Запрос.УстановитьПараметр("СписокНакладных",СписокНакладных);
		РекламационнаяТЧ=Запрос.Выполнить().Выгрузить();
		Для Каждого СтрокаТЧ Из РекламационнаяТЧ Цикл
			СтрокаТН=ИсходнаяТЧ.Добавить();
			СтрокаТН.Номенклатура = СтрокаТЧ.Номенклатура;
			СтрокаТН.НДС = СтрокаТЧ.НДС;
			СтрокаТН.Всего = СтрокаТЧ.Всего;
			СтрокаТН.Количество = СтрокаТЧ.Количество;
		КонецЦикла;
		ИсходнаяТЧ.Свернуть("Номенклатура","НДС,Количество,Всего");
		
		
		// нечаева 20,11,13 ---- 
	КонецЕсли;
	
	//крохин конец 21.11.2011
	
	
	
	
	
	Для Каждого СтрокаТЧ Из ИсходнаяТЧ Цикл
		Если СтрокаТЧ.Количество=0 Тогда Продолжить КонецЕсли; 
		
		СтрокаТН=ТН.Добавить();		
		
		СтрокаТН.Количество	=СтрокаТЧ.Количество;		
		СтрокаТН.Всего		=СтрокаТЧ.Всего;
		СтрокаТН.НДС		=СтрокаТЧ.НДС;		
		СтрокаТН.Сумма		=СтрокаТЧ.Всего-СтрокаТЧ.НДС;
		
		
		Номенклатура		=СтрокаТЧ.Номенклатура;
		Модель				=Номенклатура.Родитель;
		
		СтрокаТН.Номенклатура=СтрокаТЧ.Номенклатура;
	КонецЦикла;
	
	//Если Кратко Тогда
	//	ТН.Свернуть("Номенклатура","Количество,Сумма,НДС,Всего");
	//КонецЕсли; 
	
	ТН.Колонки.Добавить("Цена");
	ТН.Колонки.Добавить("СтавкаНДС");
	ТН.Колонки.Добавить("НоменклатураПредставление");
	ТН.Колонки.Добавить("Единица");	
	ТН.Колонки.Добавить("ОКЕИ");	
	ТН.Колонки.Добавить("Страна");
	//крохин начало 23.01.2012
	//новая форма
	ТН.Колонки.Добавить("СтранаКод");
	//крохин конец 23.01.2012
	ТН.Колонки.Добавить("НомерГТД");
	ТН.Колонки.Добавить("ШтрихКод");
	ТН.Колонки.Добавить("КодКонтрагента");
	ТН.Колонки.Добавить("КоличествоКоробок");
	ТН.Колонки.Добавить("ШтукВКоробке");
	
	Для Каждого СтрокаТН Из ТН Цикл
		Номенклатура=СтрокаТН.Номенклатура;
		Модель		=СтрокаТН.Номенклатура.родитель;
		
		//	СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
		СтрокаТН.Цена		=?(СтрокаТН.Количество=0,0,СтрокаТН.Всего/СтрокаТН.Количество);
		Если СтрокаТН.Сумма=0 Тогда
			СтрокаТН.СтавкаНДС=100*ПроцентНДСпоСтавке(ПолучитьРеквизитРодителя(СтрокаТН.Номенклатура,"СтавкаНДС"));
		Иначе			
			СтрокаТН.СтавкаНДС	=Окр(100*(СтрокаТН.НДС/СтрокаТН.Сумма),0,1);
		КонецЕсли;			
		
		СтрокаТН.Единица	="шт.";			
		СтрокаТН.ОКЕИ		="796";
		
		//ГТД
		ГТД=ПолучитьГрупповойПериодическийРеквизит(Модель,"НомерГТД",ТекДокумент.Дата);
		
		Страна	="Россия";
		НомерГТД="--------";
		//крохин начало 23.01.2012
		//новая форма
		СтранаКод = "643";
		//крохин конец 23.01.2012
		
		
		Если ГТД<>Неопределено И Врег(""+ГТД.СтранаПроисхождения)<>"РОССИЯ" И НЕ ПустаяСтрока(""+ГТД.СтранаПроисхождения) Тогда
			Страна		=""+ГТД.СтранаПроисхождения;
			НомерГТД	=СокрЛП(""+ГТД.Наименование);
			//крохин начало 23.01.2012
			//новая форма
			СтранаКод = ГТД.СтранаПроисхождения.Код;
			//крохин конец 23.01.2012
			
		КонецЕсли;
		
		Если Страна<>"Россия" И СтрДлина(НомерГТД)<25 Тогда			
			Если СтрДлина(НомерГТД)<23 Тогда
				СообщитьИзМодуля("Кривой ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");		
			Иначе
				СообщитьИзМодуля("Отсутствует 4-ый сегмент ГТД !!! Товар: """+СтрокаТН.Номенклатура+""", ГТД: """+НомерГТД+""" !");
				
				НомерГТД=НомерГТД+"/3";
			КонецЕсли; 					
		КонецЕсли; 
		//крохин начало 30.08.2012
		//новые правила заполнения СФ с 2012 года
		Если Страна="Россия" Тогда
			Страна	="--------";
		КонецЕсли;
		//крохин конец 30.08.2012
		
		
		СтрокаТН.Страна		= Страна;
		СтрокаТН.НомерГТД	= НомерГТД;
		//крохин начало 23.01.2012
		//новая форма
		СтрокаТН.СтранаКод = СтранаКод;
		//крохин конец 23.01.2012
		
		//
		//Если ПечататьШтрихКоды Тогда
		//	Если ВидШтрихКода="Внутренний" Тогда
		//		СтрокаТН.ШтрихКод=?(Кратко,СокрЛП(СтрокаТН.Номенклатура.Код77),Прав(ПолучитьШтрихКодТовара(СтрокаТН.Номенклатура),6));			
		//	ИначеЕсли ВидШтрихКода="Контрагент" Тогда
		//		СтрокаТН.ШтрихКод=ПолучитьАртикулКонтрагента(СтрокаТН.Номенклатура,ТипАртикула);				
		//	КонецЕсли;			
		//КонецЕсли;				
		//
		
		СтрокаТН.ШтукВКоробке=Модель.ШтукВКоробке;
		Если Модель.ШтукВКоробке<>0 Тогда
			СтрокаТН.КоличествоКоробок=СтрокаТН.Количество/Модель.ШтукВКоробке; 			
		КонецЕсли;	
		
		СтрокаТН.НоменклатураПредставление=СокрЛП(Модель.ТипТовара)+" "+СокрЛП(Модель.Родитель.Брэнд)+" "+СокрЛП(Модель.КодПроизводителя)+" "+Номенклатура.Наименование;		
	КонецЦикла; 
	
	//кухарь 07.07.14 начало
	//не у всех документов есть поле контрагент
	если  ТекДокумент.метаданные().реквизиты.найти("контрагент")<>Неопределено Тогда 
		// Шворобей 09.01.2024 ++ https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-2458
		Если ТекДокумент.Контрагент.СтавкаНДСКонтрагента = Перечисления.СтавкиНДС.БезНДС Тогда
			Для Каждого СтрокаТН Из ТН Цикл
				СтрокаТН.НДС = 0;
				СтрокаТН.СтавкаНДС = "Без НДС";
				//крохин начало 01.03.2013
				//цену и сумму надо пересчитать
				СтрокаТН.Сумма = СтрокаТН.Всего;
				СтрокаТН.Цена = ?(СтрокаТН.Количество=0,0,СтрокаТН.Сумма/СтрокаТН.Количество);
				//крохин конец 01.03.2013
			КонецЦикла;
		Иначе
			Для Каждого СтрокаТН Из ТН Цикл
				СтрокаТН.СтавкаНДС = ""+СтрокаТН.СтавкаНДС+ " %";
			КонецЦикла;
			
		КонецЕсли;
		//крохин конец 27.10.2011
	КонецЕсли;
	//кухарь 07.07.14 конец
	
	
	Возврат ТН;
КонецФункции // ПолучитьТаблицуНакладной()
//нечаева 03,07,14 добавила кцн---
